---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementIsElementTypeFilter
source: html/6ddaf0e7-a1a7-1032-25f6-2ccda7aa8a11.htm
---
# ElementIsElementTypeFilter Members

Constructs a new instance of a filter to match only ElementTypes.